Madelena/Obsidian-Sticky/sdkconfig.defaults
# =============================================================================
# SDKCONFIG DEFAULTS
# =============================================================================
# Board facts for the reTerminal Sticky (ESP32-S3R8, 32 MB flash, 8 MB octal
# PSRAM) plus the project's networking and console choices. Regenerate
# sdkconfig by deleting it, never edit sdkconfig by hand.

# --- Target and flash (board facts, not preferences) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: audio clip and framebuffers live here ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Runtime ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# The USB-Serial-JTAG peripheral owns GPIO19/20 by default, which are the
# PDM mic pins on this board. Console stays on UART0 (GPIO43/44) only.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- TLS: public APIs verify against the bundle; the Obsidian plugin's
# self-signed cert is accepted only when the user opts in per request ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# --- HTTP server for the setup portal ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# --- Version string shown on the info screen ---
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="0.8.0"
